In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
penguins = pd.read_csv("https://raw.githubusercontent.com/allisonhorst/palmerpenguins/c19a904462482430170bfe2c718775ddb7dbb885/inst/extdata/penguins.csv")
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [3]:
penguins.shape

(344, 8)

In [4]:
# Drop NAs
penguins.dropna(inplace=True)
penguins.shape

(333, 8)

In [5]:
penguins.species.value_counts()

Adelie       146
Gentoo       119
Chinstrap     68
Name: species, dtype: int64

In [9]:
penguins.groupby(['species','island']).size().unstack().fillna(0)

island     Biscoe  Dream  Torgersen
species
Adelie       44.0   55.0       47.0
Chinstrap     0.0   68.0        0.0
Gentoo      119.0    0.0        0.0

In [10]:
penguins.groupby(['species','sex']).size().unstack().fillna(0)

sex        female  male
species
Adelie         73    73
Chinstrap      34    34
Gentoo         58    61

In [11]:
penguins.groupby(['species','year']).size().unstack().fillna(0)

year       2007  2008  2009
species
Adelie       44    50    52
Chinstrap    26    18    24
Gentoo       33    45    41